bubble_3d_floating/constant/phaseProperties
FoamFile { version 2.0; format ascii; class dictionary; object phaseProperties; }
type massTransferMultiphaseSystem;

phases (water air);

// ここに表面張力を定義 (OpenFOAM 11のルール)
sigma 0.07;

water { type purePhaseModel; model Newtonian; }
air   { type purePhaseModel; model Newtonian; }
