bubble_3d_floating/constant/physicalProperties.water
FoamFile { version 2.0; format ascii; class dictionary; object physicalProperties.water; }
viscosityModel  Newtonian;
nu              1e-06;
rho             1000;
