bubble_3d_floating/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3600;
        startFace       637200;
    }
    atmosphere
    {
        type            patch;
        nFaces          18000;
        startFace       640800;
    }
)

// ************************************************************************* //
