bubble_3d_floating/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application foamRun;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 1.0;
deltaT 0.001;
writeControl runTime;
writeInterval 0.05;
adjustTimeStep yes;
maxCo 1;
maxAlphaCo 1;
